; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v11 ?v10)
             (pred_11 ?v4 ?v12)
             (pred_8 ?v11 ?v12)
             (pred_6 ?v9 ?v11 )
	     (pred_12 ?v11)
             (pred_9 ?v6)
             (pred_7 ?v4)
             (pred_3 ?v12)
             (pred_4 ?v11)
             (pred_1 ?v4)
             (pred_5 ?v11)
             (pred_10 ))



(:action op_5
:parameters (?v1 ?v2 ?v7 ?v5)
:precondition (and (pred_9 ?v1) (pred_9 ?v2) (pred_7 ?v7) (pred_3 ?v5)
          (pred_2 ?v1 ?v2) (pred_11 ?v7 ?v5)
                   (pred_8 ?v2 ?v5) (pred_12 ?v1) 
                   (pred_4 ?v2) (pred_1 ?v7))
:effect (and  (pred_5 ?v2) (not (pred_4 ?v2))))


(:action op_3
:parameters (?v1 ?v3)
:precondition (and (pred_9 ?v1) (pred_9 ?v3)
               (pred_12 ?v1) (pred_2 ?v1 ?v3) (pred_5 ?v3))
:effect (and (pred_12 ?v3) (not (pred_12 ?v1))))

(:action op_2
:parameters (?v1 ?v7)
:precondition (and (pred_9 ?v1) (pred_7 ?v7) 
                  (pred_12 ?v1) (pred_6 ?v7 ?v1) (pred_10 ))
:effect (and (pred_1 ?v7)
   (not (pred_6 ?v7 ?v1)) (not (pred_10 ))))


(:action op_1
:parameters (?v1 ?v8 ?v13)
:precondition (and (pred_9 ?v1) (pred_7 ?v8) (pred_7 ?v13)
                  (pred_12 ?v1) (pred_1 ?v13) (pred_6 ?v8 ?v1))
:effect (and (pred_1 ?v8) (pred_6 ?v13 ?v1)
        (not (pred_1 ?v13)) (not (pred_6 ?v8 ?v1))))

(:action op_4
:parameters (?v1 ?v7)
:precondition (and (pred_9 ?v1) (pred_7 ?v7) 
                  (pred_12 ?v1) (pred_1 ?v7))
:effect (and (pred_10 ) (pred_6 ?v7 ?v1) (not (pred_1 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_13 obj_25 obj_07 obj_27 obj_11 obj_23 obj_03 obj_21 obj_05 obj_16 obj_18 obj_01 obj_29 obj_06 obj_28 obj_20 obj_12 obj_17 obj_10 obj_22 obj_09 obj_14 obj_26 obj_31
    obj_30 obj_15 obj_08
    obj_24 obj_02 obj_04
    )

    (:init
       (pred_10)

       (pred_9 obj_19)
       (pred_9 obj_13)
       (pred_9 obj_25)
       (pred_9 obj_07)
       (pred_9 obj_27)
       (pred_9 obj_11)
       (pred_9 obj_23)
       (pred_9 obj_03)
       (pred_9 obj_21)
       (pred_9 obj_05)
       (pred_9 obj_16)
       (pred_9 obj_18)
       (pred_9 obj_01)
       (pred_9 obj_29)
       (pred_9 obj_06)
       (pred_9 obj_28)
       (pred_9 obj_20)
       (pred_9 obj_12)
       (pred_9 obj_17)
       (pred_9 obj_10)
       (pred_9 obj_22)
       (pred_9 obj_09)
       (pred_9 obj_14)
       (pred_9 obj_26)
       (pred_9 obj_31)
       (pred_3 obj_30)
       (pred_3 obj_15)
       (pred_3 obj_08)
       (pred_7 obj_24)
       (pred_7 obj_02)
       (pred_7 obj_04)

       (pred_2 obj_19 obj_11)
       (pred_2 obj_19 obj_13)
       (pred_2 obj_13 obj_23)
       (pred_2 obj_13 obj_25)
       (pred_2 obj_13 obj_19)
       (pred_2 obj_25 obj_03)
       (pred_2 obj_25 obj_07)
       (pred_2 obj_25 obj_13)
       (pred_2 obj_07 obj_21)
       (pred_2 obj_07 obj_27)
       (pred_2 obj_07 obj_25)
       (pred_2 obj_27 obj_05)
       (pred_2 obj_27 obj_07)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_11 obj_23)
       (pred_2 obj_11 obj_19)
       (pred_2 obj_23 obj_18)
       (pred_2 obj_23 obj_03)
       (pred_2 obj_23 obj_13)
       (pred_2 obj_23 obj_11)
       (pred_2 obj_03 obj_01)
       (pred_2 obj_03 obj_21)
       (pred_2 obj_03 obj_25)
       (pred_2 obj_03 obj_23)
       (pred_2 obj_21 obj_29)
       (pred_2 obj_21 obj_05)
       (pred_2 obj_21 obj_07)
       (pred_2 obj_21 obj_03)
       (pred_2 obj_05 obj_06)
       (pred_2 obj_05 obj_27)
       (pred_2 obj_05 obj_21)
       (pred_2 obj_16 obj_28)
       (pred_2 obj_16 obj_18)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_18 obj_20)
       (pred_2 obj_18 obj_01)
       (pred_2 obj_18 obj_23)
       (pred_2 obj_18 obj_16)
       (pred_2 obj_01 obj_12)
       (pred_2 obj_01 obj_29)
       (pred_2 obj_01 obj_03)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_29 obj_17)
       (pred_2 obj_29 obj_06)
       (pred_2 obj_29 obj_21)
       (pred_2 obj_29 obj_01)
       (pred_2 obj_06 obj_10)
       (pred_2 obj_06 obj_05)
       (pred_2 obj_06 obj_29)
       (pred_2 obj_28 obj_22)
       (pred_2 obj_28 obj_20)
       (pred_2 obj_28 obj_16)
       (pred_2 obj_20 obj_09)
       (pred_2 obj_20 obj_12)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_20 obj_28)
       (pred_2 obj_12 obj_14)
       (pred_2 obj_12 obj_17)
       (pred_2 obj_12 obj_01)
       (pred_2 obj_12 obj_20)
       (pred_2 obj_17 obj_26)
       (pred_2 obj_17 obj_10)
       (pred_2 obj_17 obj_29)
       (pred_2 obj_17 obj_12)
       (pred_2 obj_10 obj_31)
       (pred_2 obj_10 obj_06)
       (pred_2 obj_10 obj_17)
       (pred_2 obj_22 obj_09)
       (pred_2 obj_22 obj_28)
       (pred_2 obj_09 obj_14)
       (pred_2 obj_09 obj_20)
       (pred_2 obj_09 obj_22)
       (pred_2 obj_14 obj_26)
       (pred_2 obj_14 obj_12)
       (pred_2 obj_14 obj_09)
       (pred_2 obj_26 obj_31)
       (pred_2 obj_26 obj_17)
       (pred_2 obj_26 obj_14)
       (pred_2 obj_31 obj_10)
       (pred_2 obj_31 obj_26)
       (pred_4 obj_27)
       (pred_4 obj_07)
       (pred_4 obj_29)
       (pred_8  obj_27 obj_30)
       (pred_8  obj_07 obj_15)
       (pred_8  obj_29 obj_08)
       (pred_5 obj_19)
       (pred_5 obj_13)
       (pred_5 obj_25)
       (pred_5 obj_11)
       (pred_5 obj_23)
       (pred_5 obj_03)
       (pred_5 obj_21)
       (pred_5 obj_05)
       (pred_5 obj_16)
       (pred_5 obj_18)
       (pred_5 obj_01)
       (pred_5 obj_06)
       (pred_5 obj_28)
       (pred_5 obj_20)
       (pred_5 obj_12)
       (pred_5 obj_17)
       (pred_5 obj_10)
       (pred_5 obj_22)
       (pred_5 obj_09)
       (pred_5 obj_14)
       (pred_5 obj_26)
       (pred_5 obj_31)

       (pred_11  obj_24 obj_30)
       (pred_11  obj_02 obj_15)
       (pred_11  obj_04 obj_08)
       (pred_6 obj_24 obj_28)
       (pred_6 obj_02 obj_03)
       (pred_6 obj_04 obj_16)
       (pred_12 obj_09)
    )

    (:goal (and
       (pred_6 obj_24 obj_27)
       (pred_6 obj_02 obj_09)
    ))
(:constraints
  (always (not (pred_12 obj_20)))
)
)

; plan
1. (op_3 obj_09 obj_22)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_22)
   goals met: 0 of 2
2. (op_3 obj_22 obj_28)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_28)
   goals met: 0 of 2
3. (op_2 obj_28 obj_24)
   deleted: (pred_6 obj_24 obj_28) (pred_10)
   added: (pred_1 obj_24)
   goals met: 0 of 2
4. (op_3 obj_28 obj_16)
   deleted: (pred_12 obj_28)
   added: (pred_12 obj_16)
   goals met: 0 of 2
5. (op_3 obj_16 obj_18)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_18)
   goals met: 0 of 2
6. (op_3 obj_18 obj_23)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_23)
   goals met: 0 of 2
7. (op_3 obj_23 obj_03)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_03)
   goals met: 0 of 2
8. (op_3 obj_03 obj_21)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_21)
   goals met: 0 of 2
9. (op_3 obj_21 obj_05)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_05)
   goals met: 0 of 2
10. (op_5 obj_05 obj_27 obj_24 obj_30)
   deleted: (pred_4 obj_27)
   added: (pred_5 obj_27)
   goals met: 0 of 2
11. (op_3 obj_05 obj_27)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_27)
   goals met: 0 of 2
12. (op_4 obj_27 obj_24)
   deleted: (pred_1 obj_24)
   added: (pred_10) (pred_6 obj_24 obj_27)
   goals met: 1 of 2
13. (op_3 obj_27 obj_05)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_05)
   goals met: 1 of 2
14. (op_3 obj_05 obj_21)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_21)
   goals met: 1 of 2
15. (op_3 obj_21 obj_03)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_03)
   goals met: 1 of 2
16. (op_2 obj_03 obj_02)
   deleted: (pred_6 obj_02 obj_03) (pred_10)
   added: (pred_1 obj_02)
   goals met: 1 of 2
17. (op_3 obj_03 obj_01)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_01)
   goals met: 1 of 2
18. (op_3 obj_01 obj_12)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_12)
   goals met: 1 of 2
19. (op_3 obj_12 obj_14)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_14)
   goals met: 1 of 2
20. (op_3 obj_14 obj_09)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_09)
   goals met: 1 of 2
21. (op_4 obj_09 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_10) (pred_6 obj_02 obj_09)
   goals met: 2 of 2
